Revit 2027 API
Stairs.ActualRiserHeight Property
 The actual height of the stairs risers in the stairs.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double ActualRiserHeight { get; }
Public ReadOnly Property ActualRiserHeight As Double
	Get
public:
property double ActualRiserHeight {
	double get ();
}
member ActualRiserHeight : float with get
Property Value
Double
Remarks
 The stairs height is determined by its base and top elevation. So, the actual riser height = stairs height / desired riser number.
See Also
Reference
Stairs Class
Autodesk.Revit.DB.Architecture Namespace